RSN/src/InformationRegisters/Статистика/Статистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Статистика</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИспользуемыхЛицензий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МакимальноеКоличествоЛицензий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УИДЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Порт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючЗащиты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СетевойКлюч</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммнаяЛицензия</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыданаСервером</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяНачалаРаботы</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФайлЛицензии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/ТипыЛицензий/ТипыЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЛицензий</name>
  <enumValues>
    <name>Серверная</name>
  </enumValues>
  <enumValues>
    <name>Клиентская</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/КомплектыПоставки/КомплектыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомплектыПоставки</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛицензии</name>
    <type>
      <types>EnumRef.ТипыЛицензий</types>
    </type>
  </attributes>
  <attributes>
    <name>LicData</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКлиентскихСеансов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродукты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пинкоды</name>
    <attributes>
      <name>Пинкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПинкода</name>
      <type>
        <types>EnumRef.СтатусыПинкодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ПрограммныеПродукты/ПрограммныеПродукты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммныеПродукты</name>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляКого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УКогоКуплен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеApplication</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБухгалтер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Деятеольность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияВРегКарточке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияНаКогоКуплен</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрограммногоПродукта</name>
    <type>
      <types>CatalogRef.ВидыПрограммныхПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляКогоКуплен</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/HTTPServices/GETREPORT/Module.bsl
Функция GETLICENSESGet(Запрос) Экспорт
	
	Попытка
		
		ДатаОкончания = ТекущаяДата();
		ДатаНачала    = ДатаОкончания - 7 * 24 * 60 * 60;
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		Запрос1 = Новый Запрос;
		Запрос1.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос1.Текст = "
		|ВЫБРАТЬ
		|	СерверПриложений.Наименование КАК ИмяСервера,
		|	СерверПриложений.Ссылка       КАК Сервер
		|ПОМЕСТИТЬ ВТСерверы
		|ИЗ Справочник.СерверПриложений КАК СерверПриложений";
		Запрос1.Выполнить();
		
		Запрос2 = Новый Запрос;
		Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос2.Текст = "
		|ВЫБРАТЬ
		|	Статистика.Период КАК Дата,
		|	ВТСерверы.Сервер  КАК Сервер,
		|	СУММА(Статистика.ИспользуемыхЛицензий) КАК ВсегоИспользовано
		|ПОМЕСТИТЬ ВТСтатистика
		|ИЗ РегистрСведений.Статистика КАК Статистика
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСерверы КАК ВТСерверы
		|		ПО (ВТСерверы.ИмяСервера = Статистика.Сервер)
		|ГДЕ
		|	Статистика.ВремяНачалаРаботы МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	ВТСерверы.Сервер, Статистика.Период";
		Запрос2.УстановитьПараметр("ДатаНачала",    ДатаНачала);
		Запрос2.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		Запрос2.Выполнить();
		
		Запрос3 = Новый Запрос;
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос3.Текст = "
		|ВЫБРАТЬ
		|	КомплектыПоставки.СерверПриложений КАК СерверЛицензирования,
		|	СУММА(КомплектыПоставки.КоличествоКлиентскихСеансов) КАК ВсегоДоступноЛицензий
		|ПОМЕСТИТЬ ВТЛицензии
		|ИЗ Справочник.КомплектыПоставки КАК КомплектыПоставки
		|ГДЕ
		|	КомплектыПоставки.ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.ТипыЛицензий.Клиентская)
		|СГРУППИРОВАТЬ ПО
		|	КомплектыПоставки.СерверПриложений";
		Запрос3.Выполнить();
		
		// Финальный — группируем по СЕРВЕРУ ЛИЦЕНЗИРОВАНИЯ и дню
		ЗапросФинал = Новый Запрос;
		ЗапросФинал.МенеджерВременныхТаблиц = МенеджерВТ;
		ЗапросФинал.Текст = "
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВТСтатистика.Дата, ДЕНЬ)         КАК Дата,
		|	СерверПриложений.СерверЛицензирования           КАК СерверЛицензирования,
		|	ВТСтатистика.Сервер                              КАК Сервер,
		|	СерверПриложений.Наименование                   КАК ИмяСервера,
		|	МАКСИМУМ(ВТСтатистика.ВсегоИспользовано)        КАК МаксИспользовано,
		|	ЕСТЬNULL(ВТЛицензии.ВсегоДоступноЛицензий, 0)  КАК ВсегоДоступно
		|ИЗ ВТСтатистика КАК ВТСтатистика
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерверПриложений КАК СерверПриложений
		|		ПО (СерверПриложений.Ссылка = ВТСтатистика.Сервер)
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицензии КАК ВТЛицензии
		|		ПО (ВТЛицензии.СерверЛицензирования = СерверПриложений.СерверЛицензирования)
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВТСтатистика.Дата, ДЕНЬ),
		|	СерверПриложений.СерверЛицензирования,
		|	ВТСтатистика.Сервер,
		|	СерверПриложений.Наименование,
		|	ВТЛицензии.ВсегоДоступноЛицензий
		|УПОРЯДОЧИТЬ ПО
		|	СерверПриложений.СерверЛицензирования,
		|	Дата,
		|	ВТСтатистика.Сервер";
		
		Выборка = ЗапросФинал.Выполнить().Выбрать();
		
		// ── Структуры для графика и таблицы ──────────────────────
		// Для графика: по каждому серверу лицензирования
		// ключ = ИмяСервЛиц, значение = соответствие Дата->МаксИсп (суммируем все серверы приложений)
		ДанныеГрафика    = Новый Соответствие; // СервЛиц -> (Дата -> МаксИсп)
		ДоступноПоСервЛиц = Новый Соответствие; // СервЛиц -> ВсегоДоступно
		УникальныеДаты   = Новый Соответствие; // Дата -> Истина (для оси X)
		МассивТаблицы    = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			ИмяСервЛиц = Строка(Выборка.СерверЛицензирования);
			ДатаСтр    = Формат(Выборка.Дата, "ДФ=дд.ММ");
			МаксИсп    = Выборка.МаксИспользовано;
			ВсегоДост  = Выборка.ВсегоДоступно;
			
			// Уникальные даты для оси X
			УникальныеДаты.Вставить(ДатаСтр, Истина);
			
			// Данные графика — суммируем макс по всем серверам приложений за день
			Если ДанныеГрафика[ИмяСервЛиц] = Неопределено Тогда
				ДанныеГрафика.Вставить(ИмяСервЛиц, Новый Соответствие);
			КонецЕсли;
			ТекЗнач = ДанныеГрафика[ИмяСервЛиц][ДатаСтр];
			Если ТекЗнач = Неопределено Тогда
				ДанныеГрафика[ИмяСервЛиц].Вставить(ДатаСтр, МаксИсп);
			Иначе
				ДанныеГрафика[ИмяСервЛиц].Вставить(ДатаСтр, ТекЗнач + МаксИсп);
			КонецЕсли;
			
			// Доступно по серверу лицензирования
			ДоступноПоСервЛиц.Вставить(ИмяСервЛиц, Формат(ВсегоДост, "ЧГ=0; ЧН=0"));
			
			// Строка таблицы
			СтрТаб = Новый Структура("Дата,ИмяСервера,ИмяСервЛиц,МаксИсп,ВсегоДост,Доступно");
			СтрТаб.Дата       = Формат(Выборка.Дата, "ДФ=дд.ММ.гггг");
			СтрТаб.ИмяСервера = Строка(Выборка.ИмяСервера);
			СтрТаб.ИмяСервЛиц = ИмяСервЛиц;
			СтрТаб.МаксИсп    = Формат(МаксИсп,  "ЧГ=0; ЧН=0");
			СтрТаб.ВсегоДост  = Формат(ВсегоДост, "ЧГ=0; ЧН=0");
			СтрТаб.Доступно   = Формат(ВсегоДост - МаксИсп, "ЧГ=0; ЧН=0");
			МассивТаблицы.Добавить(СтрТаб);
		КонецЦикла;
		
		// ── Формируем labels (ось X) — отсортированные даты ──────
		МассивДат = Новый Массив;
		Для Каждого КД Из УникальныеДаты Цикл
			МассивДат.Добавить(КД.Ключ);
		КонецЦикла;
		// Сортируем простым пузырьком (дат мало — 7 штук)
		Для й = 0 По МассивДат.Количество() - 2 Цикл
			Для к = 0 По МассивДат.Количество() - й - 2 Цикл
				Если МассивДат[к] > МассивДат[к+1] Тогда
					Врем = МассивДат[к];
					МассивДат[к]   = МассивДат[к+1];
					МассивДат[к+1] = Врем;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// labels JS
		ЛейблыJS = "";
		Для Каждого Д Из МассивДат Цикл
			Если НЕ ПустаяСтрока(ЛейблыJS) Тогда ЛейблыJS = ЛейблыJS + ","; КонецЕсли;
			ЛейблыJS = ЛейблыJS + """" + Д + """";
		КонецЦикла;
		
		// ── Datasets: одна линия = один сервер лицензирования ────
		ЦветаПалитра = Новый Массив;
		ЦветаПалитра.Добавить("54,114,196");   // синий
		ЦветаПалитра.Добавить("231,76,60");    // красный
		ЦветаПалитра.Добавить("39,174,96");    // зелёный
		ЦветаПалитра.Добавить("243,156,18");   // жёлтый
		ЦветаПалитра.Добавить("142,68,173");   // фиолетовый
		ЦветаПалитра.Добавить("22,160,133");   // бирюзовый
		
		ДатасетыJS  = "";
		ИндексЦвета = 0;
		
		Для Каждого КлючЗнач Из ДанныеГрафика Цикл
			ИмяСервЛиц = КлючЗнач.Ключ;
			ДатыПоСерв = КлючЗнач.Значение;
			Цвет        = ЦветаПалитра[ИндексЦвета % ЦветаПалитра.Количество()];
			ДоступноЧисло = ДоступноПоСервЛиц[ИмяСервЛиц];
			
			// Значения строго по порядку дат
			ЗначенияJS = "";
			Для Каждого Д Из МассивДат Цикл
				Если НЕ ПустаяСтрока(ЗначенияJS) Тогда ЗначенияJS = ЗначенияJS + ","; КонецЕсли;
				ЗначДня = ДатыПоСерв[Д];
				ЗначенияJS = ЗначенияJS + ?(ЗначДня = Неопределено, "null", Формат(ЗначДня, "ЧГ=0; ЧН=0"));
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(ДатасетыJS) Тогда ДатасетыJS = ДатасетыJS + ","; КонецЕсли;
			// Линия — использовано
			ДатасетыJS = ДатасетыJS + "
			|{
			|  label: 'Использовано: " + ИмяСервЛиц + "',
			|  data: [" + ЗначенияJS + "],
			|  borderColor: 'rgba(" + Цвет + ",1)',
			|  backgroundColor: 'rgba(" + Цвет + ",0.08)',
			|  borderWidth: 2, pointRadius: 5, tension: 0.3, fill: false
			|},
			|{
			|  label: 'Доступно: " + ИмяСервЛиц + "',
			|  data: Array(" + Формат(МассивДат.Количество(), "ЧГ=0") + ").fill(" + ДоступноЧисло + "),
			|  borderColor: 'rgba(" + Цвет + ",0.35)',
			|  borderDash: [6,4],
			|  borderWidth: 1.5, pointRadius: 0, tension: 0, fill: false
			|}";
			
			ИндексЦвета = ИндексЦвета + 1;
		КонецЦикла;
		
		// ── Карточки серверов лицензирования ─────────────────────
		КарточкиHTML = "";
		Для Каждого КлючЗнач Из ДоступноПоСервЛиц Цикл
			// Последнее использовано по этому серверу
			ПоследняяДата = ?(МассивДат.Количество() > 0, МассивДат[МассивДат.Количество()-1], "");
			ПослИсп = 0;
			Если НЕ ПустаяСтрока(ПоследняяДата) И ДанныеГрафика[КлючЗнач.Ключ] <> Неопределено Тогда
				ЗначПосл = ДанныеГрафика[КлючЗнач.Ключ][ПоследняяДата];
				Если ЗначПосл <> Неопределено Тогда ПослИсп = ЗначПосл; КонецЕсли;
			КонецЕсли;
			Доступно  = Число(КлючЗнач.Значение) - ПослИсп;
			Перц      = ?(Число(КлючЗнач.Значение) > 0,
			Цел(ПослИсп / Число(КлючЗнач.Значение) * 100), 0);
			ЦветПерц  = ?(Перц >= 90, "#e74c3c", ?(Перц >= 70, "#f39c12", "#27ae60"));
			КарточкиHTML = КарточкиHTML + "
			|<div class='lic-card'>
			|  <div class='lic-name'> " + КлючЗнач.Ключ + "</div>
			|  <div class='lic-row'>
			|    <div class='lic-block'>
			|      <div class='lic-val blue'>" + КлючЗнач.Значение + "</div>
			|      <div class='lic-lbl'>Всего</div>
			|    </div>
			|    <div class='lic-block'>
			|      <div class='lic-val' style='color:" + ЦветПерц + "'>" + Формат(ПослИсп, "ЧГ=0; ЧН=0") + "</div>
			|      <div class='lic-lbl'>Использовано</div>
			|    </div>
			|    <div class='lic-block'>
			|      <div class='lic-val green'>" + Формат(Доступно, "ЧГ=0; ЧН=0") + "</div>
			|      <div class='lic-lbl'>Свободно</div>
			|    </div>
			|    <div class='lic-block'>
			|      <div class='lic-val' style='color:" + ЦветПерц + "'>" + Формат(Перц, "ЧГ=0") + "%</div>
			|      <div class='lic-lbl'>Загрузка</div>
			|    </div>
			|  </div>
			|  <div class='progress-wrap'>
			|    <div class='progress-bar' style='width:" + Формат(Перц, "ЧГ=0") + "%;background:" + ЦветПерц + "'></div>
			|  </div>
			|</div>";
		КонецЦикла;
		
		// ── Строки таблицы ────────────────────────────────────────
		ТекущийСервЛиц = Неопределено;
		ТекущийСервер  = Неопределено;
		НомерГруппы    = 0;
		НомерСтроки    = 0;
		ТелоТаблицы    = "";
		ИдГруппы       = "";
		
		Для Каждого СтрТаб Из МассивТаблицы Цикл
			
			Если СтрТаб.ИмяСервЛиц <> ТекущийСервЛиц Тогда
				ТекущийСервЛиц = СтрТаб.ИмяСервЛиц;
				ТекущийСервер  = Неопределено;
				НомерГруппы    = НомерГруппы + 1;
				НомерСтроки    = 0;
				ИдГруппы       = "g" + Формат(НомерГруппы, "ЧГ=0");
				ТелоТаблицы    = ТелоТаблицы + "
				|<tr class='grp-lic' onclick=""toggleGroup('" + ИдГруппы + "')"">
				|  <td colspan='6'>
				|    <span id='icon_" + ИдГруппы + "'>▼</span>
				|    &nbsp; " + ТекущийСервЛиц + "
				|    <span class='badge-avail'>Всего: " + СтрТаб.ВсегоДост + "</span>
				|  </td>
				|</tr>";
			КонецЕсли;
			
			Если СтрТаб.ИмяСервера <> ТекущийСервер Тогда
				ТекущийСервер = СтрТаб.ИмяСервера;
				НомерСтроки   = 0;
				ТелоТаблицы   = ТелоТаблицы + "
				|<tr class='grp-srv kontour-group " + ИдГруппы + "'>
				|  <td colspan='6'> " + ТекущийСервер + "</td>
				|</tr>";
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			КлассСтр    = ?(НомерСтроки % 2 = 0, "even", "odd");
			Перц = 0;
			Если Число(СтрТаб.ВсегоДост) > 0 Тогда
				Перц = Цел(Число(СтрТаб.МаксИсп) / Число(СтрТаб.ВсегоДост) * 100);
			КонецЕсли;
			ЦветПерц = ?(Перц >= 90, "#e74c3c", ?(Перц >= 70, "#f39c12", "#27ae60"));
			
			ТелоТаблицы = ТелоТаблицы + "
			|<tr class='" + КлассСтр + " kontour-group " + ИдГруппы + "'>
			|  <td>" + СтрТаб.Дата + "</td>
			|  <td>" + СтрТаб.ИмяСервера + "</td>
			|  <td style='text-align:center; font-weight:600'>" + СтрТаб.МаксИсп + "</td>
			|  <td style='text-align:center'>" + СтрТаб.ВсегоДост + "</td>
			|  <td style='text-align:center;color:" + ЦветПерц + ";font-weight:700'>" + Формат(Перц, "ЧГ=0") + "%</td>
			|  <td style='text-align:center;color:" + ?(Число(СтрТаб.Доступно) < 0, "#e74c3c", "#27ae60") + ";font-weight:600'>" + СтрТаб.Доступно + "</td>
			|</tr>";
			
		КонецЦикла;
		
		ПериодСтр = Формат(ДатаНачала, "ДФ=дд.ММ.гггг") + " — " + Формат(ДатаОкончания, "ДФ=дд.ММ.гггг");
		
		HTML = "<!DOCTYPE html>
		|<html><head><meta charset='utf-8'>
		|<title>Лицензии — динамика за неделю</title>
		|<script src='https://cdn.jsdelivr.net/npm/chart.js@4.4.0/dist/chart.umd.min.js'></script>
		|<style>
		|  *, *::before, *::after { box-sizing: border-box; }
		|  body  { font-family: Segoe UI, Arial, sans-serif; font-size: 10pt;
		|          background: #f0f4f9; margin: 0; padding: 20px; }
		|  h2    { color: #2c3e50; border-bottom: 3px solid #4472C4;
		|          padding-bottom: 8px; margin-bottom: 20px; }
		|  /* Карточки */
		|  .cards { display: flex; gap: 16px; flex-wrap: wrap; margin-bottom: 20px; }
		|  .lic-card { background: white; border-radius: 10px; padding: 16px 20px;
		|              box-shadow: 0 2px 8px rgba(0,0,0,0.09); min-width: 280px;
		|              border-top: 4px solid #4472C4; flex: 1; }
		|  .lic-name { font-size: 9pt; font-weight: 700; color: #2c3e50; margin-bottom: 12px; }
		|  .lic-row  { display: flex; gap: 10px; margin-bottom: 10px; }
		|  .lic-block { flex: 1; text-align: center; }
		|  .lic-val  { font-size: 18pt; font-weight: 700; line-height: 1.1; }
		|  .lic-val.blue  { color: #4472C4; }
		|  .lic-val.green { color: #27ae60; }
		|  .lic-lbl  { font-size: 8pt; color: #aaa; margin-top: 2px; }
		|  .progress-wrap { background: #eee; border-radius: 6px; height: 8px; overflow: hidden; }
		|  .progress-bar  { height: 8px; border-radius: 6px; transition: width .4s; }
		|  /* График */
		|  .chart-wrap  { background: white; border-radius: 10px; padding: 20px;
		|                 box-shadow: 0 2px 8px rgba(0,0,0,0.09); margin-bottom: 20px; }
		|  .chart-title { font-size: 11pt; font-weight: 700; color: #2c3e50; margin-bottom: 14px; }
		|  /* Таблица */
		|  .tbl-header { display: flex; align-items: center; justify-content: space-between;
		|                margin-bottom: 8px; flex-wrap: wrap; gap: 8px; }
		|  .tbl-title  { font-size: 11pt; font-weight: 700; color: #2c3e50; }
		|  .btn { padding: 6px 14px; border: none; border-radius: 6px;
		|         cursor: pointer; font-size: 9pt; font-weight: 600; }
		|  .btn-blue { background: #4472C4; color: white; }
		|  .btn-blue:hover { background: #2c5aa0; }
		|  .btn-gray { background: #999; color: white; }
		|  .btn-gray:hover { background: #666; }
		|  .tbl-wrap { background: white; border-radius: 10px; overflow: hidden;
		|              box-shadow: 0 2px 8px rgba(0,0,0,0.09); }
		|  table { border-collapse: collapse; width: 100%; }
		|  th { background: #4472C4; color: white; padding: 9px 8px;
		|       text-align: left; font-size: 9pt; font-weight: 600; }
		|  td { padding: 6px 8px; border-bottom: 1px solid #e8ecf0; }
		|  tr.odd  td { background: #fff; }
		|  tr.even td { background: #f0f4ff; }
		|  tr:hover td { background: #dce8ff !important; }
		|  .grp-lic td { background: #2c3e50 !important; color: white;
		|                font-weight: 700; font-size: 10pt; padding: 9px 12px;
		|                cursor: pointer; user-select: none; }
		|  .grp-lic:hover td { background: #3d5166 !important; }
		|  .grp-srv td { background: #dce8ff !important; color: #2c3e50;
		|                font-weight: 600; border-left: 4px solid #4472C4; }
		|  .badge-avail { background: #4472C4; color: white; font-size: 8pt;
		|                 padding: 2px 8px; border-radius: 10px; margin-left: 10px; }
		|  .footer { margin-top: 16px; color: #aaa; font-size: 8pt; }
		|</style>
		|</head><body>
		|<h2> Динамика лицензий &nbsp;<small style='font-size:10pt;color:#888'>" + ПериодСтр + "</small></h2>
		|
		|<div class='cards'>" + КарточкиHTML + "</div>
		|
		|<div class='chart-wrap'>
		|  <div class='chart-title'> Использование лицензий по дням (сервер лицензирования)</div>
		|  <canvas id='licChart' height='80'></canvas>
		|</div>
		|
		|<div class='tbl-header'>
		|  <span class='tbl-title'> Детализация по серверам приложений</span>
		|  <div style='display:flex;gap:8px'>
		|    <button class='btn btn-blue' onclick='expandAll()'>▼ Развернуть</button>
		|    <button class='btn btn-gray' onclick='collapseAll()'>▶ Свернуть</button>
		|  </div>
		|</div>
		|<div class='tbl-wrap'>
		|<table>
		|<thead><tr>
		|  <th>Дата</th>
		|  <th>Сервер приложений</th>
		|  <th style='text-align:center'>Макс. использовано</th>
		|  <th style='text-align:center'>Всего доступно</th>
		|  <th style='text-align:center'>Загрузка</th>
		|  <th style='text-align:center'>Свободно</th>
		|</tr></thead>
		|<tbody>" + ТелоТаблицы + "
		|</tbody></table>
		|</div>
		|<div class='footer'>Сформировано: " + Формат(ТекущаяДата(), "ДФ=дд.ММ.гггг ЧЧ:мм:сс") + "</div>
		|
		|<script>
		|new Chart(document.getElementById('licChart'), {
		|  type: 'line',
		|  data: {
		|    labels: [" + ЛейблыJS + "],
		|    datasets: [" + ДатасетыJS + "]
		|  },
		|  options: {
		|    responsive: true,
		|    interaction: { mode: 'index', intersect: false },
		|    plugins: {
		|      legend: { position: 'top' },
		|      tooltip: {
		|        callbacks: {
		|          label: function(ctx) {
		|            return ' ' + ctx.dataset.label + ': ' + ctx.parsed.y;
		|          }
		|        }
		|      }
		|    },
		|    scales: {
		|      x: { title: { display: true, text: 'Дата' } },
		|      y: { beginAtZero: true, title: { display: true, text: 'Лицензий' } }
		|    }
		|  }
		|});
		|function toggleGroup(id) {
		|  var rows = document.querySelectorAll('.' + id);
		|  var icon = document.getElementById('icon_' + id);
		|  var collapsed = icon.textContent === '▶';
		|  rows.forEach(function(r) { r.style.display = collapsed ? '' : 'none'; });
		|  icon.textContent = collapsed ? '▼' : '▶';
		|}
		|function expandAll() {
		|  document.querySelectorAll('.kontour-group').forEach(function(r) { r.style.display = ''; });
		|  document.querySelectorAll('[id^=""icon_""]').forEach(function(i) { i.textContent = '▼'; });
		|}
		|function collapseAll() {
		|  document.querySelectorAll('.kontour-group').forEach(function(r) { r.style.display = 'none'; });
		|  document.querySelectorAll('[id^=""icon_""]').forEach(function(i) { i.textContent = '▶'; });
		|}
		|</script>
		|</body></html>";
		
	Исключение
		ОтветОшибка = Новый HTTPСервисОтвет(500);
		ОтветОшибка.Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
		ОтветОшибка.УстановитьТелоИзСтроки("Ошибка: " + ОписаниеОшибки());
		Возврат ОтветОшибка;
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(HTML);
	Возврат Ответ;
	
КонецФункции

Функция GETREPORTGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции


// ═══════════════════════════════════════════════════════════════
// HTTP-сервис: POSTMESSAGE
// Назначение: CRUD-интерфейс справочника ПрограммныеПродукты
// Методы: GET  — список + карточка редактирования
//         POST — сохранение изменений
// ═══════════════════════════════════════════════════════════════

// ──────────────────────────────────────────────────────────────
// БЛОК 1: Точка входа GET — маршрутизация
// ──────────────────────────────────────────────────────────────
Функция POSTMESSAGEGet(Запрос) Экспорт
	
	Попытка
		
		// ПараметрыЗапроса — это query string (?id=...), НЕ ПараметрыURL
		// ПараметрыURL — только для параметров шаблона вида /POSTMESSAGE/{id}/
		ИдСтр = Запрос.ПараметрыЗапроса.Получить("id");
		
		Если ИдСтр = Неопределено ИЛИ ПустаяСтрока(ИдСтр) Тогда
			СписокДанных = ПолучитьСписокПродуктов();
			HTML = СформироватьHTMLСписок(СписокДанных);
		Иначе
			ДанныеЭлемента = ПолучитьДанныеЭлемента(ИдСтр);
			HTML = СформироватьHTMLКарточку(ДанныеЭлемента);
		КонецЕсли;
		
	Исключение
		Возврат СформироватьОтветОшибка(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат СформироватьОтвет200(HTML);
	
КонецФункции// ──────────────────────────────────────────────────────────────
// БЛОК 2: Точка входа POST — сохранение изменений из карточки
// Принимает JSON с реквизитами, обновляет элемент справочника
// ──────────────────────────────────────────────────────────────
Функция POSTMESSAGEPost(Запрос) Экспорт
	
	Попытка
		
		// Читаем тело запроса (JSON) встроенными средствами платформы
		ТелоJSON = Запрос.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоJSON);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		// Сохраняем и получаем результат
		РезультатСохранения = СохранитьЭлемент(ДанныеJSON);
		
		Возврат СформироватьОтветJSON(РезультатСохранения);
		
	Исключение
		Возврат СформироватьОтветОшибка(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// ══════════════════════════════════════════════════════════════
// БЛОК 3: Получение данных из БД
// ══════════════════════════════════════════════════════════════

// Возвращает массив структур: все элементы справочника ПрограммныеПродукты
Функция ПолучитьСписокПродуктов()
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПП.Ссылка                   КАК Ссылка,
	|	ПП.Код                      КАК Код,
	|	ПП.Наименование             КАК Наименование,
	|	ПП.Продукт                  КАК Продукт,
	|	ПП.ДляКого                  КАК ДляКого,
	|	ПП.УКогоКуплен              КАК УКогоКуплен,
	|	ПП.Логин                    КАК Логин,
	|	ПП.Пароль                   КАК Пароль,
	|	ПП.СрокДействия             КАК СрокДействия,
	|	ПП.Почта                    КАК Почта,
	|	ПП.Телефон                  КАК Телефон,
	|	ПП.РасположениеApplication  КАК РасположениеApplication,
	|	ПП.ОтветственныйБухгалтер   КАК ОтветственныйБухгалтер,
	|	ПП.ОрганизацияВРегКарточке  КАК ОрганизацияВРегКарточке,
	|	ПП.ОрганизацияНаКогоКуплен  КАК ОрганизацияНаКогоКуплен,
	|	ПП.ВидПрограммногоПродукта  КАК ВидПрограммногоПродукта,
	|	ПП.ОрганизацияДляКогоКуплен КАК ОрганизацияДляКогоКуплен
	|ИЗ
	|	Справочник.ПрограммныеПродукты КАК ПП
	|ГДЕ
	|	ПП.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	ПП.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Структура строго соответствует полям запроса — без лишних ключей
		Стр = Новый Структура(
		"Ссылка, Код, Наименование, Продукт, ДляКого, УКогоКуплен,
		|Логин, Пароль, СрокДействия, Почта, Телефон,
		|РасположениеApplication, ОтветственныйБухгалтер,
		|ОрганизацияВРегКарточке, ОрганизацияНаКогоКуплен,
		|ВидПрограммногоПродукта, ОрганизацияДляКогоКуплен");
		
		Стр.Ссылка                   = XMLСтрока(Выборка.Ссылка);
		Стр.Код                      = Строка(Выборка.Код);
		Стр.Наименование             = Строка(Выборка.Наименование);
		Стр.Продукт                  = Строка(Выборка.Продукт);
		Стр.ДляКого                  = Строка(Выборка.ДляКого);
		Стр.УКогоКуплен              = Строка(Выборка.УКогоКуплен);
		Стр.Логин                    = Строка(Выборка.Логин);
		Стр.Пароль                   = Строка(Выборка.Пароль);
		Стр.СрокДействия             = Формат(Выборка.СрокДействия, "ДФ=дд.ММ.гггг");
		Стр.Почта                    = Строка(Выборка.Почта);
		Стр.Телефон                  = Строка(Выборка.Телефон);
		Стр.РасположениеApplication  = Строка(Выборка.РасположениеApplication);
		Стр.ОтветственныйБухгалтер   = Строка(Выборка.ОтветственныйБухгалтер);
		Стр.ОрганизацияВРегКарточке  = Строка(Выборка.ОрганизацияВРегКарточке);
		Стр.ОрганизацияНаКогоКуплен  = Строка(Выборка.ОрганизацияНаКогоКуплен);
		Стр.ВидПрограммногоПродукта  = Строка(Выборка.ВидПрограммногоПродукта);
		Стр.ОрганизацияДляКогоКуплен = Строка(Выборка.ОрганизацияДляКогоКуплен);
		
		Массив.Добавить(Стр);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает структуру со всеми реквизитами одного элемента по XML-строке ссылки
Функция ПолучитьДанныеЭлемента(ИдСтр)
	
	Ссылка = XMLЗначение(Тип("СправочникСсылка.ПрограммныеПродукты"), ИдСтр);
	Объект = Ссылка.ПолучитьОбъект();
	
	Если Объект = Неопределено Тогда
		ВызватьИсключение "Элемент не найден: " + ИдСтр;
	КонецЕсли;
	
	// Стандартные поля
	Данные = Новый Структура;
	Данные.Вставить("Ссылка",       ИдСтр);
	Данные.Вставить("Наименование", Строка(Объект.Наименование));
	Данные.Вставить("Код",          Строка(Объект.Код));
	
	// Перебираем все реквизиты метаданных — универсально
	Для Каждого Рекв Из Объект.Метаданные().Реквизиты Цикл
		ЗначРекв = Объект[Рекв.Имя];
		Если ТипЗнч(ЗначРекв) = Тип("Булево")
			ИЛИ ТипЗнч(ЗначРекв) = Тип("Число")
			ИЛИ ТипЗнч(ЗначРекв) = Тип("Строка") Тогда
			Данные.Вставить(Рекв.Имя, ЗначРекв);
		ИначеЕсли ТипЗнч(ЗначРекв) = Тип("Дата") Тогда
			Данные.Вставить(Рекв.Имя, Формат(ЗначРекв, "ДФ=дд.ММ.гггг"));
		Иначе
			Данные.Вставить(Рекв.Имя, Строка(ЗначРекв));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

// ══════════════════════════════════════════════════════════════
// БЛОК 4: Сохранение изменений в БД
// ══════════════════════════════════════════════════════════════

Функция СохранитьЭлемент(ДанныеJSON)
	
	ИдСтр  = ДанныеJSON["id"];
	Ссылка = XMLЗначение(Тип("СправочникСсылка.ПрограммныеПродукты"), ИдСтр);
	Объект = Ссылка.ПолучитьОбъект();
	
	Если Объект = Неопределено Тогда
		ВызватьИсключение "Элемент не найден: " + ИдСтр;
	КонецЕсли;
	
	Мета = Объект.Метаданные();
	
	Для Каждого КлючЗнач Из ДанныеJSON Цикл
		ИмяРекв = КлючЗнач.Ключ;
		Если ИмяРекв = "id" Тогда Продолжить; КонецЕсли;
		
		Если ИмяРекв = "Наименование" Тогда
			Объект.Наименование = КлючЗнач.Значение;
			Продолжить;
		КонецЕсли;
		
		МетаРекв = Мета.Реквизиты.Найти(ИмяРекв);
		Если МетаРекв = Неопределено Тогда Продолжить; КонецЕсли;
		
		ТипыРекв = МетаРекв.Тип.Типы();
		Если ТипыРекв.Количество() > 0 Тогда
			ЦелевойТип = ТипыРекв[0];
			Попытка
				Если ЦелевойТип = Тип("Булево") Тогда
					Объект[ИмяРекв] = КлючЗнач.Значение = "true" ИЛИ КлючЗнач.Значение = Истина;
				ИначеЕсли ЦелевойТип = Тип("Число") Тогда
					Объект[ИмяРекв] = Число(КлючЗнач.Значение);
				ИначеЕсли ЦелевойТип = Тип("Дата") Тогда
					Объект[ИмяРекв] = ЗначениеИзСтрокиВнутр(КлючЗнач.Значение);
				Иначе
					Объект[ИмяРекв] = КлючЗнач.Значение;
				КонецЕсли;
			Исключение
				// Пропускаем поле, если не удалось привести тип
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Истина);
	Объект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	Рез = Новый Структура("ok, message, id");
	Рез.ok      = Истина;
	Рез.message = "Сохранено успешно";
	Рез.id      = ИдСтр;
	Возврат Рез;
	
КонецФункции

// ══════════════════════════════════════════════════════════════
// БЛОК 6: Формирование HTML-интерфейса
// ══════════════════════════════════════════════════════════════

Функция ШаблонHTML(Заголовок, ТелоHTML)
	
	Возврат "<!DOCTYPE html>
	|<html><head><meta charset='utf-8'>
	|<title>" + Заголовок + "</title>
	|<style>
	|  *, *::before, *::after { box-sizing: border-box; }
	|  body { font-family: Segoe UI, Arial, sans-serif; font-size: 10pt;
	|         background: #f0f4f9; margin: 0; padding: 20px; }
	|  h2   { color: #2c3e50; border-bottom: 3px solid #4472C4;
	|         padding-bottom: 8px; margin-bottom: 20px; }
	|  .tbl-wrap { background: white; border-radius: 10px; overflow: hidden;
	|              box-shadow: 0 2px 8px rgba(0,0,0,.09); }
	|  table { border-collapse: collapse; width: 100%; }
	|  th { background: #4472C4; color: white; padding: 9px 12px;
	|       text-align: left; font-size: 9pt; }
	|  td { padding: 7px 12px; border-bottom: 1px solid #e8ecf0; }
	|  tr:nth-child(even) td { background: #f0f4ff; }
	|  tr.data-row:hover td { background: #dce8ff !important; cursor: pointer; }
	|  .link-btn { color: #4472C4; text-decoration: none; font-weight: 600; }
	|  .link-btn:hover { text-decoration: underline; }
	|  .card { background: white; border-radius: 10px; padding: 24px;
	|          box-shadow: 0 2px 8px rgba(0,0,0,.09);
	|          max-width: 700px; border-top: 4px solid #4472C4; }
	|  .form-row { display: flex; gap: 16px; margin-bottom: 14px; align-items: center; }
	|  .form-row label { width: 220px; font-weight: 600; color: #2c3e50; flex-shrink: 0; }
	|  .form-row input { flex: 1; padding: 7px 10px; border: 1px solid #ccd4e0;
	|      border-radius: 6px; font-size: 10pt; outline: none; }
	|  .form-row input:focus { border-color: #4472C4;
	|      box-shadow: 0 0 0 2px rgba(68,114,196,.15); }
	|  .form-row input[readonly] { background: #f5f7fb; color: #888; }
	|  .btn { padding: 8px 22px; border: none; border-radius: 7px;
	|         cursor: pointer; font-size: 10pt; font-weight: 600; }
	|  .btn-save { background: #27ae60; color: white; }
	|  .btn-save:hover { background: #1e8449; }
	|  .btn-back { background: #4472C4; color: white; margin-right: 10px; }
	|  .btn-back:hover { background: #2c5aa0; }
	|  .toast { display:none; position:fixed; bottom:30px; right:30px;
	|           background:#27ae60; color:white; padding:12px 24px;
	|           border-radius:8px; font-weight:600;
	|           box-shadow:0 4px 12px rgba(0,0,0,.2); z-index:999; }
	|  .toast.err { background: #e74c3c; }
	|  .footer { margin-top: 16px; color: #aaa; font-size: 8pt; }
	|</style></head><body>
	|" + ТелоHTML + "
	|<div class='footer'>Сформировано: " + Формат(ТекущаяДата(), "ДФ=дд.ММ.гггг ЧЧ:мм:сс") + "</div>
	|</body></html>";
	
КонецФункции

// Формирует HTML-страницу со списком программных продуктов
// ИСПРАВЛЕНИЕ: ссылка кодируется через JS encodeURIComponent на стороне клиента,
// чтобы спецсимволы XML-ссылки (#, :, пробелы) не ломали URL
Функция СформироватьHTMLСписок(СписокДанных)
	
	СтрокиТаблицы = "";
	Для Каждого Эл Из СписокДанных Цикл
		// Ссылку экранируем для безопасной вставки в HTML-атрибут data-id
		БезопасныйИд = СтрЗаменить(СтрЗаменить(Эл.Ссылка, """", "&quot;"), "'", "&#39;");
		СтрокиТаблицы = СтрокиТаблицы + "
		|<tr class='data-row' data-id='" + БезопасныйИд + "' style='cursor:pointer'>
		|  <td>" + Эл.Код + "</td>
		|  <td style='color:#4472C4;font-weight:600'>" + Эл.Наименование + "</td>
		|</tr>";
	КонецЦикла;
	
	Тело = "
	|<h2> Программные продукты</h2>
	|<div class='tbl-wrap'>
	|<table>
	|<thead><tr>
	|  <th style='width:130px'>Код</th>
	|  <th>Наименование</th>
	|</tr></thead>
	|<tbody>" + СтрокиТаблицы + "</tbody>
	|</table></div>
	|<script>
	|// Переход в карточку через encodeURIComponent — корректно обрабатывает
	|// XML-строки ссылок 1С со спецсимволами (#, :, пробелы)
	|document.querySelectorAll('tr.data-row').forEach(function(row) {
	|  row.addEventListener('click', function() {
	|    var id = row.getAttribute('data-id');
	|    window.location.href = '?' + 'id=' + encodeURIComponent(id);
	|  });
	|});
	|</script>";
	
	Возврат ШаблонHTML("Программные продукты", Тело);
	
КонецФункции

// Формирует HTML-карточку редактирования элемента справочника
Функция СформироватьHTMLКарточку(Данные)
	
	// Поля только для чтения
	ПоляЧтение = Новый Соответствие;
	ПоляЧтение.Вставить("Ссылка", Истина);
	ПоляЧтение.Вставить("Код",    Истина);
	
	СтрокиФормы = "";
	Для Каждого КлючЗнач Из Данные Цикл
		ИмяПоля  = КлючЗнач.Ключ;
		ЗначПоля = КлючЗнач.Значение;
		РО       = ?(ПоляЧтение[ИмяПоля] <> Неопределено, " readonly", "");
		
		// Ссылка передаётся скрытым полем — в форме не показываем
		Если ИмяПоля = "Ссылка" Тогда Продолжить; КонецЕсли;
		
		Если ТипЗнч(ЗначПоля) = Тип("Булево") Тогда
			Чекед = ?(ЗначПоля, " checked", "");
			СтрокиФормы = СтрокиФормы + "
			|<div class='form-row'>
			|  <label>" + ИмяПоля + "</label>
			|  <input type='checkbox' name='" + ИмяПоля + "'" + Чекед + ">
			|</div>";
		Иначе
			БезопасноеЗнач = СтрЗаменить(СтрЗаменить(Строка(ЗначПоля), "&", "&amp;"), """", "&quot;");
			СтрокиФормы = СтрокиФормы + "
			|<div class='form-row'>
			|  <label>" + ИмяПоля + "</label>
			|  <input type='text' name='" + ИмяПоля + "'" + РО + " value=""" + БезопасноеЗнач + """>
			|</div>";
		КонецЕсли;
	КонецЦикла;
	
	Тело = "
	|<div id='toast' class='toast'></div>
	|<h2>✏️ Редактирование: " + Данные["Наименование"] + "</h2>
	|<div class='card'>
	|  <form id='editForm'>
	|    <input type='hidden' name='id' value='" + СтрЗаменить(Данные["Ссылка"], "'", "&#39;") + "'>
	|    " + СтрокиФормы + "
	|    <div style='margin-top:20px'>
	|      <button type='button' class='btn btn-back'
	|        onclick=""history.back()"">← Назад к списку</button>
	|      <button type='button' class='btn btn-save' onclick='saveForm()'> Сохранить</button>
	|    </div>
	|  </form>
	|</div>
	|<script>
	|function saveForm() {
	|  var form = document.getElementById('editForm');
	|  var data = {};
	|  Array.from(form.elements).forEach(function(el) {
	|    if (!el.name) return;
	|    data[el.name] = (el.type === 'checkbox') ? el.checked : el.value;
	|  });
	|  fetch(location.href.split('?')[0], {
	|    method: 'POST',
	|    headers: { 'Content-Type': 'application/json; charset=utf-8' },
	|    body: JSON.stringify(data)
	|  })
	|  .then(function(r) {
	|    return r.text().then(function(txt) {
	|      try { return JSON.parse(txt); }
	|      catch(e) { throw new Error(txt.substring(0, 500)); }
	|    });
	|  })
	|  .then(function(res) { showToast(res.message, !res.ok); })
	|  .catch(function(e) { showToast(e.message, true); });
	|}
	|function showToast(msg, isErr) {
	|  var t = document.getElementById('toast');
	|  t.className = 'toast' + (isErr ? ' err' : '');
	|  t.textContent = msg;
	|  t.style.display = 'block';
	|  setTimeout(function() { t.style.display = 'none'; }, 3000);
	|}
	|</script>";
	
	Возврат ШаблонHTML("Редактирование — " + Данные["Наименование"], Тело);
	
КонецФункции

// ══════════════════════════════════════════════════════════════
// БЛОК 7: Вспомогательные функции формирования HTTP-ответов
// ══════════════════════════════════════════════════════════════

Функция СформироватьОтвет200(HTML)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(HTML);
	Возврат Ответ;
КонецФункции

Функция СформироватьОтветJSON(Знач ДанныеСтруктура)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеСтруктура);
	JSONСтрока = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(JSONСтрока);
	Возврат Ответ;
КонецФункции

Функция СформироватьОтветОшибка(ТекстОшибки)
	Ответ = Новый HTTPСервисОтвет(500);
	Ответ.Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки("Ошибка: " + ТекстОшибки);
	Возврат Ответ;
КонецФункции
